-- MySQL dump 10.13  Distrib 8.0.45, for Win64 (x86_64)
--
-- Host: localhost    Database: dashboard
-- ------------------------------------------------------
-- Server version	8.0.45

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `machine_axis_description`
--

DROP TABLE IF EXISTS `machine_axis_description`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `machine_axis_description` (
  `id_mad` int NOT NULL,
  `id_mtn` int DEFAULT NULL,
  `axis` varchar(45) DEFAULT NULL,
  `temp` int DEFAULT NULL,
  `status` int DEFAULT NULL,
  PRIMARY KEY (`id_mad`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `machine_axis_description`
--

LOCK TABLES `machine_axis_description` WRITE;
/*!40000 ALTER TABLE `machine_axis_description` DISABLE KEYS */;
INSERT INTO `machine_axis_description` VALUES (1,1,'X',80,0),(2,1,'Y',100,0),(3,1,'Z',40,1),(4,1,'C',70,0),(5,1,'B',90,0),(6,1,'P',50,1),(7,1,'V',60,1),(8,2,'X',80,0),(9,2,'Y',50,0),(10,2,'Z',90,0),(11,2,'C',70,0),(12,2,'B',50,1),(13,2,'P',100,0),(14,2,'V',40,1),(15,3,'X',30,1),(16,3,'Y',80,1),(17,3,'Z',80,0),(18,3,'C',20,1),(19,3,'B',90,0),(20,3,'P',30,1),(21,3,'V',50,1),(22,4,'X',40,1),(23,4,'Y',50,1),(24,4,'Z',70,0),(25,4,'C',50,0),(26,4,'B',40,1),(27,4,'P',30,1),(28,4,'V',90,0),(29,5,'X',90,1),(30,5,'Y',90,0),(31,6,'X',30,1),(32,6,'Y',80,1),(33,6,'Z',40,1),(34,7,'X',90,1),(35,7,'Y',90,1),(36,7,'Z',30,1),(37,7,'C',60,0);
/*!40000 ALTER TABLE `machine_axis_description` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `machine_tool_load`
--

DROP TABLE IF EXISTS `machine_tool_load`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `machine_tool_load` (
  `id_mtl` int NOT NULL AUTO_INCREMENT,
  `id_mtn` int DEFAULT NULL,
  `hr` time DEFAULT NULL,
  `temp` int DEFAULT NULL,
  PRIMARY KEY (`id_mtl`)
) ENGINE=InnoDB AUTO_INCREMENT=193 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `machine_tool_load`
--

LOCK TABLES `machine_tool_load` WRITE;
/*!40000 ALTER TABLE `machine_tool_load` DISABLE KEYS */;
INSERT INTO `machine_tool_load` VALUES (1,1,'01:00:00',51),(2,1,'02:00:00',41),(3,1,'03:00:00',83),(4,1,'04:00:00',65),(5,1,'05:00:00',47),(6,1,'06:00:00',92),(7,1,'07:00:00',99),(8,1,'08:00:00',53),(9,1,'09:00:00',44),(10,1,'10:00:00',83),(11,1,'11:00:00',94),(12,1,'12:00:00',60),(13,1,'13:00:00',33),(14,1,'14:00:00',100),(15,1,'15:00:00',32),(16,1,'16:00:00',73),(17,1,'17:00:00',49),(18,1,'18:00:00',70),(19,1,'19:00:00',53),(20,1,'20:00:00',97),(21,1,'21:00:00',54),(22,1,'22:00:00',65),(23,1,'23:00:00',34),(24,1,'24:00:00',27),(25,2,'01:00:00',66),(26,2,'02:00:00',77),(27,2,'03:00:00',24),(28,2,'04:00:00',33),(29,2,'05:00:00',48),(30,2,'06:00:00',51),(31,2,'07:00:00',59),(32,2,'08:00:00',23),(33,2,'09:00:00',88),(34,2,'10:00:00',30),(35,2,'11:00:00',38),(36,2,'12:00:00',76),(37,2,'13:00:00',73),(38,2,'14:00:00',43),(39,2,'15:00:00',52),(40,2,'16:00:00',57),(41,2,'17:00:00',49),(42,2,'18:00:00',88),(43,2,'19:00:00',30),(44,2,'20:00:00',96),(45,2,'21:00:00',88),(46,2,'22:00:00',53),(47,2,'23:00:00',88),(48,2,'24:00:00',67),(49,3,'01:00:00',59),(50,3,'02:00:00',28),(51,3,'03:00:00',33),(52,3,'04:00:00',81),(53,3,'05:00:00',30),(54,3,'06:00:00',75),(55,3,'07:00:00',87),(56,3,'08:00:00',68),(57,3,'09:00:00',44),(58,3,'10:00:00',96),(59,3,'11:00:00',80),(60,3,'12:00:00',74),(61,3,'13:00:00',77),(62,3,'14:00:00',86),(63,3,'15:00:00',70),(64,3,'16:00:00',65),(65,3,'17:00:00',59),(66,3,'18:00:00',63),(67,3,'19:00:00',53),(68,3,'20:00:00',39),(69,3,'21:00:00',95),(70,3,'22:00:00',60),(71,3,'23:00:00',75),(72,3,'24:00:00',96),(73,4,'01:00:00',96),(74,4,'02:00:00',41),(75,4,'03:00:00',67),(76,4,'04:00:00',63),(77,4,'05:00:00',55),(78,4,'06:00:00',75),(79,4,'07:00:00',91),(80,4,'08:00:00',99),(81,4,'09:00:00',65),(82,4,'10:00:00',63),(83,4,'11:00:00',33),(84,4,'12:00:00',64),(85,4,'13:00:00',97),(86,4,'14:00:00',95),(87,4,'15:00:00',66),(88,4,'16:00:00',28),(89,4,'17:00:00',76),(90,4,'18:00:00',42),(91,4,'19:00:00',98),(92,4,'20:00:00',81),(93,4,'21:00:00',69),(94,4,'22:00:00',49),(95,4,'23:00:00',89),(96,4,'24:00:00',77),(97,5,'01:00:00',54),(98,5,'02:00:00',80),(99,5,'03:00:00',41),(100,5,'04:00:00',72),(101,5,'05:00:00',20),(102,5,'06:00:00',66),(103,5,'07:00:00',89),(104,5,'08:00:00',28),(105,5,'09:00:00',87),(106,5,'10:00:00',67),(107,5,'11:00:00',48),(108,5,'12:00:00',21),(109,5,'13:00:00',49),(110,5,'14:00:00',97),(111,5,'15:00:00',80),(112,5,'16:00:00',46),(113,5,'17:00:00',47),(114,5,'18:00:00',96),(115,5,'19:00:00',86),(116,5,'20:00:00',35),(117,5,'21:00:00',49),(118,5,'22:00:00',29),(119,5,'23:00:00',90),(120,5,'24:00:00',90),(121,6,'01:00:00',51),(122,6,'02:00:00',86),(123,6,'03:00:00',93),(124,6,'04:00:00',39),(125,6,'05:00:00',63),(126,6,'06:00:00',78),(127,6,'07:00:00',85),(128,6,'08:00:00',61),(129,6,'09:00:00',36),(130,6,'10:00:00',30),(131,6,'11:00:00',63),(132,6,'12:00:00',62),(133,6,'13:00:00',69),(134,6,'14:00:00',96),(135,6,'15:00:00',78),(136,6,'16:00:00',88),(137,6,'17:00:00',100),(138,6,'18:00:00',86),(139,6,'19:00:00',50),(140,6,'20:00:00',79),(141,6,'21:00:00',25),(142,6,'22:00:00',52),(143,6,'23:00:00',87),(144,6,'24:00:00',91),(145,7,'01:00:00',33),(146,7,'02:00:00',29),(147,7,'03:00:00',26),(148,7,'04:00:00',61),(149,7,'05:00:00',92),(150,7,'06:00:00',48),(151,7,'07:00:00',79),(152,7,'08:00:00',32),(153,7,'09:00:00',52),(154,7,'10:00:00',21),(155,7,'11:00:00',56),(156,7,'12:00:00',89),(157,7,'13:00:00',66),(158,7,'14:00:00',94),(159,7,'15:00:00',70),(160,7,'16:00:00',44),(161,7,'17:00:00',63),(162,7,'18:00:00',50),(163,7,'19:00:00',21),(164,7,'20:00:00',32),(165,7,'21:00:00',100),(166,7,'22:00:00',70),(167,7,'23:00:00',28),(168,7,'24:00:00',34),(169,8,'01:00:00',86),(170,8,'02:00:00',41),(171,8,'03:00:00',34),(172,8,'04:00:00',82),(173,8,'05:00:00',45),(174,8,'06:00:00',74),(175,8,'07:00:00',42),(176,8,'08:00:00',53),(177,8,'09:00:00',94),(178,8,'10:00:00',99),(179,8,'11:00:00',65),(180,8,'12:00:00',95),(181,8,'13:00:00',53),(182,8,'14:00:00',91),(183,8,'15:00:00',30),(184,8,'16:00:00',64),(185,8,'17:00:00',93),(186,8,'18:00:00',75),(187,8,'19:00:00',66),(188,8,'20:00:00',74),(189,8,'21:00:00',98),(190,8,'22:00:00',66),(191,8,'23:00:00',65),(192,8,'24:00:00',47);
/*!40000 ALTER TABLE `machine_tool_load` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `machine_tool_name`
--

DROP TABLE IF EXISTS `machine_tool_name`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `machine_tool_name` (
  `id_mtn` int NOT NULL,
  `machine_tool_name` tinytext,
  `id_mt` int DEFAULT NULL,
  PRIMARY KEY (`id_mtn`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `machine_tool_name`
--

LOCK TABLES `machine_tool_name` WRITE;
/*!40000 ALTER TABLE `machine_tool_name` DISABLE KEYS */;
INSERT INTO `machine_tool_name` VALUES (1,'SPECTR G%-Y',1),(2,'SPITZEN H65/1250SY2',1),(3,'KTC 4000',1),(4,'DMG MORI NTX 1000',1),(5,'WATTSON 1830',2),(6,'LITZ CV-800',3),(7,'SCR 456',4);
/*!40000 ALTER TABLE `machine_tool_name` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `machine_tool_state`
--

DROP TABLE IF EXISTS `machine_tool_state`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `machine_tool_state` (
  `id_mts` int NOT NULL,
  `id_mtn` int DEFAULT NULL,
  `imp` int DEFAULT NULL,
  `hr` time DEFAULT NULL,
  `text` varchar(100) DEFAULT NULL,
  `type` varchar(45) DEFAULT NULL,
  `channel` int DEFAULT NULL,
  `code` int DEFAULT NULL,
  PRIMARY KEY (`id_mts`),
  UNIQUE KEY `id_mts_UNIQUE` (`id_mts`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `machine_tool_state`
--

LOCK TABLES `machine_tool_state` WRITE;
/*!40000 ALTER TABLE `machine_tool_state` DISABLE KEYS */;
INSERT INTO `machine_tool_state` VALUES (1,1,2,'06:12:44','NC: Аварийный останов (E-Stop) активен с пульта оператора ЧПУ','set',1,1900),(2,1,1,'08:30:15','KernelPLC: Низкий уровень смазки направляющих осей','set',1,835),(3,1,2,'11:05:00','NC: Ошибка слежения оси X (Превышение контурного допуска)','set',2,1701),(4,1,0,'14:22:19','NC: Управляющая программа: Выполнение технологического цикла завершено','set',1,2050),(5,1,1,'16:45:02','NC: Синтаксическая ошибка: недопустимый G-код в текущем кадре УП','set',3,1802),(6,2,2,'07:15:33','KernelPLC: Сбой инициализации модулей ввода-вывода','set',1,801),(7,2,1,'10:12:00','KernelPLC: Датчик ограждения рабочей зоны станка разомкнут','set',1,840),(8,2,2,'13:14:55','KernelPLC: Ошибка связи по шине EtherCAT / Profinet','set',1,805),(9,2,1,'15:40:22','NC: Превышена максимальная рабочая подача контура контурной обработки','set',2,1725),(10,2,0,'19:11:40','KernelPLC: Загрузка технологической программы PLC завершена успешно','set',1,892),(11,3,1,'08:20:11','NC: Круговая интерполяция невозможна (ошибка расчета радиуса дуги)','set',1,2010),(12,3,2,'09:55:04','KernelPLC: Критическое падение давления в гидросистеме','set',2,812),(13,3,2,'12:01:30','NC: Ошибка слежения оси Y (Превышение контурного допуска)','set',1,1702),(14,3,0,'15:10:12','KernelPLC: Предупреждение: требуется плановое ТО системы фильтрации СОЖ','set',1,880),(15,3,1,'17:30:59','NC: Достигнут программный лимит ограничения перемещения в направлении (+)','set',3,1720),(16,4,2,'08:02:50','KernelPLC: Сбой автоматического позиционирования инструментального магазина','set',1,855),(17,4,1,'10:44:12','KernelPLC: Перегрузка автомата защиты привода стружкоудаления','set',1,872),(18,4,1,'11:59:31','KernelPLC: Перегрев масла в баке термостабилизации шпинделя','set',2,820),(19,4,2,'14:05:08','NC: Ошибка интерполяции сплайна в кадре управляющей программы','set',1,1750),(20,4,1,'16:12:43','NC: Кадр УП: пропущен обязательный адрес параметра геометрии калибра','set',2,1815),(21,5,2,'09:11:00','NC: Ошибка слежения оси Z (Превышение контурного допуска)','set',1,1703),(22,5,2,'11:22:15','NC: Аварийный останов (E-Stop) активен с пульта оператора ЧПУ','set',1,1900),(23,5,1,'13:44:23','KernelPLC: Датчик ограждения рабочей зоны станка разомкнут','set',2,840),(24,5,1,'15:18:50','NC: Синтаксическая ошибка: недопустимый G-код в текущем кадре УП','set',1,1802),(25,5,0,'17:01:11','NC: Управляющая программа: Выполнение технологического цикла завершено','set',3,2050),(26,6,1,'08:50:34','KernelPLC: Низкий уровень смазки направляющих осей','set',1,835),(27,6,2,'10:30:12','KernelPLC: Сбой инициализации модулей ввода-вывода','set',1,801),(28,6,1,'12:15:45','NC: Достигнут программный лимит ограничения перемещения в направлении (+)','set',3,1720),(29,6,2,'14:50:00','KernelPLC: Критическое падение давления в гидросистеме','set',2,812),(30,6,1,'16:05:22','KernelPLC: Перегрузка автомата защиты привода стружкоудаления','set',1,872),(31,7,2,'07:55:18','KernelPLC: Ошибка связи по шине EtherCAT / Profinet','set',1,805),(32,7,1,'09:40:40','KernelPLC: Перегрев масла в баке термостабилизации шпинделя','set',2,820),(33,7,2,'11:15:12','NC: Ошибка слежения оси X (Превышение контурного допуска)','set',1,1701),(34,7,1,'13:20:05','NC: Круговая интерполяция невозможна (ошибка расчета радиуса дуги)','set',1,2010),(35,7,0,'15:55:37','KernelPLC: Загрузка технологической программы PLC завершена успешно','set',2,892);
/*!40000 ALTER TABLE `machine_tool_state` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `machine_tool_type`
--

DROP TABLE IF EXISTS `machine_tool_type`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `machine_tool_type` (
  `id_mt` int NOT NULL,
  `type` varchar(222) DEFAULT NULL,
  `axis` int DEFAULT NULL,
  PRIMARY KEY (`id_mt`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `machine_tool_type`
--

LOCK TABLES `machine_tool_type` WRITE;
/*!40000 ALTER TABLE `machine_tool_type` DISABLE KEYS */;
INSERT INTO `machine_tool_type` VALUES (1,'Токарно-фрезерный',7),(2,'Лазерный',2),(3,'Вертикально-фрезерный',3),(4,'Шлифовальный',4);
/*!40000 ALTER TABLE `machine_tool_type` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-17 17:00:41
